#+TITLE: The org-ref manual (version 3)
#+AUTHOR: John Kitchin
#+DATE: [2021-08-25 Wed]
#+OPTIONS: toc:nil ^:{}
#+LATEX_HEADER: \usepackage{natbib}
#+LATEX_HEADER: \usepackage[version=3]{mhchem}
#+latex_header: \usepackage{makeidx}
#+latex_header: \usepackage{cleveref}
#+latex_header: \makeindex
# This ridiculousness is to make the index start in the middle of a page.
# https://tex.stackexchange.com/questions/23870/index-shouldnt-start-new-page
#+latex_header: \makeatletter
#+latex_header: \renewenvironment{theindex}
#+latex_header:                {\section*{\indexname}%
#+latex_header:                 \@mkboth{\MakeUppercase\indexname}%
#+latex_header:                         {\MakeUppercase\indexname}%
#+latex_header:                 \thispagestyle{plain}\parindent\z@
#+latex_header:                 \parskip\z@ \@plus .3\p@\relax
#+latex_header:                 \columnseprule \z@
#+latex_header:                 \columnsep 35\p@
#+latex_header:                 \let\item\@idxitem}
#+latex_header:                {}
#+latex_header: \makeatother

#+latex_header: \usepackage{glossaries}
#+latex_header: \makeglossaries
#+latex_header_extra: \newglossaryentry{acronym}{name={acronym},description={An acronym is an abbreviation used as a word which is formed from the initial components in a phrase or a word. Usually these components are individual letters (as in NATO or laser) or parts of words or names (as in Benelux)}}
#+latex_header_extra: \newacronym{tla}{TLA}{Three Letter Acronym}

@@latex:\maketitle@@
@@latex:\tableofcontents@@

** Some basic org-ref utilities
[[index:bibtex!clean entry]]

The command ~org-ref~ does a lot for you automatically. It will check the buffer for errors, e.g. multiply-defined labels, bad citations or ref links, and provide easy access to a few commands through a side-window buffer.

~org-ref-clean-bibtex-entry~ will sort the fields of a bibtex entry, clean it, and give it a bibtex key. By default, this function does a lot of cleaning:

1. adds a comma if needed in the first line of the entry
2. makes sure the DOI field is an actual DOI, and not a URL
3. fixes bad year entries
4. fixes empty pages
5. escapes ampersand and percentage signs
6. generate a key according to your setup
7. runs your hook functions
8. sorts the fields in the entry
9. checks the entry for non-ascii characters
10. converts article title to title case (note: see below to convert titles in other entry types)



This function has a hook ~org-ref-clean-bibtex-entry-hook~, which you can add functions to of your own. Each function must work on a bibtex entry at point. (Note: the default behavior can be changed by removing the relevant functions from the initial value of ~org-ref-clean-bibtex-entry-hook~.)

Here are the functions run on cleaning:

#+BEGIN_SRC emacs-lisp :exports both
org-ref-clean-bibtex-entry-hook
#+END_SRC

#+RESULTS:
| org-ref-bibtex-format-url-if-doi | orcb-key-comma | org-ref-replace-nonascii | orcb-& | orcb-% | org-ref-title-case-article | orcb-clean-year | orcb-key | orcb-clean-doi | orcb-clean-pages | orcb-check-journal | org-ref-sort-bibtex-entry | orcb-fix-spacing |

You can add your own function to the hook like this.

#+BEGIN_SRC emacs-lisp
(add-hook 'org-ref-clean-bibtex-entry-hook 'org-ref-replace-nonascii)
#+END_SRC

~org-ref-extract-bibtex-entries~ will create a bibtex file from the citations in the current buffer.

*** biblatex users  <<sec-biblatex-users>>

In the latex header you specify the style and bibliography file using addbibresource. Here is an example:

#+BEGIN_EXAMPLE
#+latex_header: \usepackage[citestyle=authoryear-icomp,bibstyle=authoryear, hyperref=true,backref=true,maxcitenames=3,url=true,backend=biber,natbib=true] {biblatex}
#+latex_header: \addbibresource{tests/test-1.bib}
#+END_EXAMPLE

Sometimes it is necessary to tell bibtex what dialect you are using to support the different bibtex entries that are possible in biblatex. You can do it like this globally.

#+BEGIN_SRC emacs-lisp
(setq bibtex-dialect 'biblatex)
#+END_SRC

#+RESULTS:
: biblatex

Or like this in a bibtex file:
#+BEGIN_EXAMPLE
% -*- mode:bibtex; eval: (bibtex-set-dialect 'biblatex); -*-
#+END_EXAMPLE

Make sure you invoke biblatex in the org-latex-pdf-process. Here is one way to do it.

#+BEGIN_SRC emacs-lisp
(setq  org-latex-pdf-process '("latexmk -shell-escape -bibtex -pdf %f"))
#+END_SRC

Finally, where you want the bibliography put this empty link:

#+BEGIN_EXAMPLE
[[printbibliography:]]
#+END_EXAMPLE

The regular biblatex cite links support common pre/post notes, and multiple keys. These are:

#+BEGIN_SRC emacs-lisp :exports both
org-ref-biblatex-types
#+END_SRC

#+RESULTS:
| Cite         |
| parencite    |
| Parencite    |
| footcite     |
| footcitetext |
| textcite     |
| Textcite     |
| smartcite    |
| Smartcite    |
| cite*        |
| parencite*   |
| supercite    |
| autocite     |
| Autocite     |
| autocite*    |
| Autocite*    |
| Citeauthor*  |
| citetitle    |
| citetitle*   |
| citedate     |
| citedate*    |
| citeurl      |
| fullcite     |
| footfullcite |
| notecite     |
| Notecite     |
| pnotecite    |
| Pnotecite    |
| fnotecite    |

The multitype links support common pre/postnotes, and individual pre/post notes.  These are the multicite commands:

#+BEGIN_SRC emacs-lisp :exports both
org-ref-biblatex-multitypes
#+END_SRC

#+RESULTS:
| cites         |
| Cites         |
| parencites    |
| Parencites    |
| footcites     |
| footcitetexts |
| smartcites    |
| Smartcites    |
| textcites     |
| Textcites     |
| supercites    |
| autocites     |
| Autocites     |


Here is a full example. This only exports correctly in biblatex or with CSL, so I include it as an example here.

#+BEGIN_EXAMPLE
 [[cites:See; in &kitchin-2015-examp page 1;in &kitchin-2015-data-surfac-scien page 2;and in &kitchin-2016-autom-data page 3; for examples]]
#+END_EXAMPLE


*** Troubleshooting doi-utils

Occasionally weird things happen with a DOI. The first thing you should check is if the json data for the DOI can be retrieved. You can do that at the command line, or in a sh block like this:

#+BEGIN_SRC sh
curl -LH "Accept: application/citeproc+json" "http://doi.org/10.1021/jp511426q"
#+END_SRC

If you do not get json data, doi-utils will not be able to generate the bibtex entry.

Not all PDFs can be retrieved. doi-utils uses a set of functions to attempt this. Here is the list.

#+BEGIN_SRC emacs-lisp :exports both
doi-utils-pdf-url-functions
#+END_SRC

#+RESULTS:
| aps-pdf-url                 |
| science-pdf-url             |
| nature-pdf-url              |
| wiley-pdf-url               |
| springer-chapter-pdf-url    |
| springer-pdf-url            |
| acs-pdf-url-1               |
| acs-pdf-url-2               |
| acs-pdf-url-3               |
| iop-pdf-url                 |
| jstor-pdf-url               |
| aip-pdf-url                 |
| science-direct-pdf-url      |
| linkinghub-elsevier-pdf-url |
| tandfonline-pdf-url         |
| ecs-pdf-url                 |
| ecst-pdf-url                |
| rsc-pdf-url                 |
| pnas-pdf-url                |
| copernicus-pdf-url          |
| sage-pdf-url                |
| jneurosci-pdf-url           |
| ieee-pdf-url                |
| ieee2-pdf-url               |
| ieee3-pdf-url               |
| acm-pdf-url                 |
| osa-pdf-url                 |
| asme-biomechanical-pdf-url  |
| siam-pdf-url                |
| agu-pdf-url                 |
| plos-pdf-url                |
| generic-full-pdf-url        |

You can check if a url for the PDF can be found like this. If you get a url, you can probably download a pdf.

#+BEGIN_SRC emacs-lisp :exports both
(doi-utils-get-pdf-url "10.1021/jp511426q")
#+END_SRC

#+RESULTS:
: https://pubs.acs.org/doi/pdf/10.1021/jp511426q

*** Other formats using CSL

org-ref supports export to other formats using [[https://github.com/andras-simonyi/citeproc-el][citeproc]] in a preprocessing filter. This works by modifying a copy of your org-file during the export to replace the citation and bibliography links with formatted text using the CSL. These functions are defined in [[./org-ref-export.el]]. You set the style with `org-ref-csl-default-style' or with a =CSL-KEYWORD=. See  [[./examples/basic-csl.org]] for an example.

org-ref provides a new exporter for convenience with the following export options: After C-c C-e r

| a | to ascii and open      |                                                                 |
| h | to html and open       |                                                                 |
| l | to latex and open      | all cite links and bibliography are exported to latex           |
| o | to OpenOffice and open |                                                                 |
| O | to org buffer          | only goes to a buffer so you don't overwrite the current buffer |
| e | to email               |                                                                 |

These links will run export commands to get this document in different formats. It is worth noting that if your bibtex entries use LaTeX markup (e.g. subscripts, superscripts, chemical equations, etc.) in them, it will probably not render faithfully in the alternative backend. It is in general difficult to have a single format in bibtex that correctly renders in all backends. I don't know of a great solution for this, since LaTeX and CSL use different citation processors.

[[elisp:(org-ref-export-to-html)]]

[[elisp:(org-ref-export-to-latex)]]

[[elisp:(org-ref-export-to-ascii)]]

[[elisp:(org-ref-export-to-odt)]]

[[elisp:(org-ref-export-to-message)]] export to body of an ascii email message

Some basic styles are provide in [[./citeproc/csl-locales/]], and a US-English locale in [[./citeproc/csl-locales/]].

#+BEGIN_SRC sh :exports both
ls citeproc/csl-styles
#+END_SRC

#+RESULTS:
| apa-5th-edition.csl                  |
| apa-numeric-superscript-brackets.csl |
| chicago-author-date-16th-edition.csl |
| elsevier-harvard.csl                 |
| elsevier-with-titles.csl             |


An alternative to this exporter is to use an  `org-export-before-parsing-hook' to do the pre-processing like this. This should work for most backends with the usual export keys and commands.

#+BEGIN_SRC emacs-lisp
(add-hook 'org-export-before-parsing-hook 'org-ref-csl-preprocess-buffer)
#+END_SRC

Here is an example to generate a docx file from this document!

#+BEGIN_SRC emacs-lisp
(require 'ox-pandoc)
(let ((org-export-before-parsing-hook '(org-ref-csl-preprocess-buffer)))
  (org-open-file (plist-get (org-pandoc-export-to-docx) 'output-file) 'system))
#+END_SRC

#+RESULTS:

